{"label": 2, "text": "Animal Type: Cat. Breed 1: Tabby. Breed 2: Unknown Breed. Color 1: Black. Color 2: White. Color 3: Unknown Color. State: Selangor. Age: 3. Gender: 1. MaturitySize: 1. FurLength: 1. Vaccinated: 2. Dewormed: 2. Sterilized: 2. Health: 1. Quantity: 1. Fee: 100. VideoAmt: 0. Description: Nibble is a 3+ month old ball of cuteness. He is energetic and playful. I rescued a couple of cats a few months ago but could not get them neutered in time as the clinic was fully scheduled. The result was this little kitty. I do not have enough space and funds to care for more cats in my household. Looking for responsible people to take over Nibble's care.. PhotoAmt: 1.0."}
{"label": 0, "text": "Animal Type: Cat. Breed 1: Domestic Medium Hair. Breed 2: Unknown Breed. Color 1: Black. Color 2: Brown. Color 3: Unknown Color. State: Kuala Lumpur. Age: 1. Gender: 1. MaturitySize: 2. FurLength: 2. Vaccinated: 3. Dewormed: 3. Sterilized: 3. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: I just found it alone yesterday near my apartment. It was shaking so I had to bring it home to provide temporary care.. PhotoAmt: 2.0."}
{"label": 3, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Brown. Color 2: White. Color 3: Unknown Color. State: Selangor. Age: 1. Gender: 1. MaturitySize: 2. FurLength: 2. Vaccinated: 1. Dewormed: 1. Sterilized: 2. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: Their pregnant mother was dumped by her irresponsible owner at the roadside near some shops in Subang Jaya. Gave birth to them at the roadside. They are all healthy and adorable puppies. Already dewormed, vaccinated and ready to go to a home. No tying or caging for long hours as guard dogs. However, it is acceptable to cage or tie for precautionary purposes. Interested to adopt pls call me.. PhotoAmt: 7.0."}
{"label": 2, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Black. Color 2: Brown. Color 3: Unknown Color. State: Kuala Lumpur. Age: 4. Gender: 2. MaturitySize: 2. FurLength: 1. Vaccinated: 1. Dewormed: 1. Sterilized: 2. Health: 1. Quantity: 1. Fee: 150. VideoAmt: 0. Description: Good guard dog, very alert, active, obedience waiting for her good master, plz call or sms for more details if you really get interested, thanks!!. PhotoAmt: 8.0."}
{"label": 2, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Black. Color 2: Unknown Color. Color 3: Unknown Color. State: Selangor. Age: 1. Gender: 1. MaturitySize: 2. FurLength: 1. Vaccinated: 2. Dewormed: 2. Sterilized: 2. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: This handsome yet cute boy is up for adoption. He is the most playful pal we've seen in our puppies. He loves to nibble on shoelaces , Chase you at such a young age. Imagine what a cute brat he will be when he grows. We are looking for a loving home for Hunter , one that will take care of him and give him the love that he needs. Please call urgently if you would like to adopt this cutie.. PhotoAmt: 3.0."}
{"label": 2, "text": "Animal Type: Cat. Breed 1: Domestic Short Hair. Breed 2: Unknown Breed. Color 1: Cream. Color 2: Gray. Color 3: Unknown Color. State: Selangor. Age: 3. Gender: 2. MaturitySize: 2. FurLength: 1. Vaccinated: 2. Dewormed: 2. Sterilized: 2. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: This is a stray kitten that came to my house. Have been feeding it, but cannot keep it.. PhotoAmt: 2.0."}
{"label": 1, "text": "Animal Type: Cat. Breed 1: Domestic Long Hair. Breed 2: Domestic Long Hair. Color 1: Black. Color 2: Unknown Color. Color 3: Unknown Color. State: Selangor. Age: 12. Gender: 1. MaturitySize: 2. FurLength: 3. Vaccinated: 2. Dewormed: 2. Sterilized: 3. Health: 1. Quantity: 1. Fee: 300. VideoAmt: 0. Description: anyone within the area of ipoh or taiping who interested to adopt my cat can contact my father at this number (mazuvil)or can just email me. currently bulat is at my hometown at perak but anyone outside the area still want to adopt can travel there to my hometown.there is a lot of cats in my house rite now..i think i should let one of them go to a better owner who can give better attention to him.. PhotoAmt: 3.0."}
{"label": 3, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Black. Color 2: Brown. Color 3: White. State: Selangor. Age: 0. Gender: 2. MaturitySize: 2. FurLength: 1. Vaccinated: 2. Dewormed: 2. Sterilized: 2. Health: 1. Quantity: 6. Fee: 0. VideoAmt: 0. Description: Siu Pak just give birth on 13/6/10 to 6puppies. Interested pls call or sms me. Left 2female puppies on 2/7/10. PhotoAmt: 9.0."}
{"label": 1, "text": "Animal Type: Cat. Breed 1: Domestic Medium Hair. Breed 2: Unknown Breed. Color 1: Gray. Color 2: Unknown Color. Color 3: Unknown Color. State: Selangor. Age: 2. Gender: 2. MaturitySize: 2. FurLength: 2. Vaccinated: 2. Dewormed: 2. Sterilized: 2. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: healthy and active, feisty kitten found in neighbours' garden. Not sure of sex.. PhotoAmt: 6.0."}
{"label": 4, "text": "Animal Type: Cat. Breed 1: Domestic Medium Hair. Breed 2: Unknown Breed. Color 1: Black. Color 2: White. Color 3: Unknown Color. State: Selangor. Age: 12. Gender: 2. MaturitySize: 2. FurLength: 2. Vaccinated: 3. Dewormed: 3. Sterilized: 3. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: Very manja and gentle stray cat found, we would really like to find a home for it because we cannot keep her for ourselves for long. Has a very cute high pitch but soft meow. Please contact me if you would be interested in adopting.. PhotoAmt: 2.0."}
{"label": 1, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Black. Color 2: Brown. Color 3: White. State: Kuala Lumpur. Age: 2. Gender: 1. MaturitySize: 2. FurLength: 1. Vaccinated: 2. Dewormed: 1. Sterilized: 2. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: For serious adopter, please do sms or call for more details, thanks!. PhotoAmt: 7.0."}
{"label": 1, "text": "Animal Type: Cat. Breed 1: Domestic Long Hair. Breed 2: Unknown Breed. Color 1: Black. Color 2: Brown. Color 3: Cream. State: Selangor. Age: 3. Gender: 2. MaturitySize: 3. FurLength: 3. Vaccinated: 1. Dewormed: 1. Sterilized: 2. Health: 1. Quantity: 1. Fee: 50. VideoAmt: 0. Description: Kali is a super playful kitten who is on the go the minute she wakes up. She is very quiet and only meows very rarely. She likes to cuddle when she is sleepy and also when she wakes up from a nap. As long as she has her toys, she keeps herself active and busy during the day. Would recommend you spend at least half an hour every night to play with her as it is her normal routine now. Would recommend that you house her alone as a single cat or with another kitten. She has had her second vaccination and deworming and needs another one next month. Serious adopters only please. Looking for a good forever home for Kali. For more info/photos please whatsapp. PhotoAmt: 2.0."}
{"label": 2, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Brown. Color 2: Cream. Color 3: Gray. State: Selangor. Age: 2. Gender: 1. MaturitySize: 2. FurLength: 3. Vaccinated: 1. Dewormed: 1. Sterilized: 2. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: Peanut was an abused puppy until he was rescued. He was very scared of people but now he is a very happy and active puppy! He is a really loving puppy now. (: Lester Jenny Will you adopt him? ================================================== Adopters are required to vaccinate and neuter them. ==================================================. PhotoAmt: 1.0."}
{"label": 1, "text": "Animal Type: Cat. Breed 1: Domestic Medium Hair. Breed 2: Unknown Breed. Color 1: Black. Color 2: Gray. Color 3: White. State: Selangor. Age: 2. Gender: 3. MaturitySize: 1. FurLength: 2. Vaccinated: 2. Dewormed: 2. Sterilized: 3. Health: 1. Quantity: 7. Fee: 0. VideoAmt: 0. Description: Hi Pet Lovers! This is my first posting and I need help! 3 months ago we befriended a mother stray cat with 3 kittens in our area and we 'adopted' them but they come and go as they please. 2 months ago the mother gave birth to a litter of 7 cute kittens and we have been taking care of the mother and the kittens ever since in our home...in the ground floor bathroom! Some of the kittens look half-persian with long hair,evident also from the earlier stray batch we adopted. Looking for good caring homes.... PhotoAmt: 1.0."}
{"label": 2, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Brown. Color 2: Cream. Color 3: White. State: Kuala Lumpur. Age: 3. Gender: 2. MaturitySize: 2. FurLength: 2. Vaccinated: 3. Dewormed: 3. Sterilized: 3. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: Lost Dog Found (Bandar Menjalara, Kepong／Taman Bukit Maluri or Desa Park City) 迷途犬被尋獲 (甲洞孟加拉惹／武吉馬魯里／Desa Park City) Area lost puppy found 小狗被發現地點：Bandar Sri Menjalara, Kepong, KL, Malaysia 大馬吉隆坡甲洞孟加拉惹 How the lost dog found 狗兒如何被發現: The lost puppy entered my staying place itself. 迷途小狗自行進我居住地。 Condition 情況: 雖好像幾天沒進食。看起來健康。頸上系有紅帶。目前甲洞孟加拉惹住宅區保安處看顧。Few days without food. Looks healthy. Neck tied with red belt. Currently taken care by security guard of housing area of Bandar Menjalara.. PhotoAmt: 2.0."}
{"label": 4, "text": "Animal Type: Dog. Breed 1: Terrier. Breed 2: Shih Tzu. Color 1: Black. Color 2: White. Color 3: Unknown Color. State: Selangor. Age: 78. Gender: 1. MaturitySize: 2. FurLength: 2. Vaccinated: 3. Dewormed: 3. Sterilized: 3. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: We moved out of our apartment to a landed home and there were many friendly strays in the neighbourhood. My grandma's neighbour was moving homes and was looking for a home for their pet.I pleaded with my mom to let us adopt him and he's fun-loving, he plays football and is a great goalie yet a loyal guardog. Now we are moving abroad and Max has no home.. PhotoAmt: 2.0."}
{"label": 3, "text": "Animal Type: Cat. Breed 1: Domestic Short Hair. Breed 2: Unknown Breed. Color 1: Brown. Color 2: Unknown Color. Color 3: Unknown Color. State: Selangor. Age: 6. Gender: 2. MaturitySize: 1. FurLength: 1. Vaccinated: 1. Dewormed: 1. Sterilized: 1. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: to be spayed on /12 adorable & friendly. PhotoAmt: 1.0."}
{"label": 4, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Mixed Breed. Color 1: Brown. Color 2: Unknown Color. Color 3: Unknown Color. State: Perak. Age: 8. Gender: 2. MaturitySize: 2. FurLength: 1. Vaccinated: 2. Dewormed: 1. Sterilized: 1. Health: 1. Quantity: 1. Fee: 10. VideoAmt: 0. Description: shes active... she can obey wht command that u told her.. example shakeshand . sleep and eat .. command in english n tamil :).. she will bark if thr suspicius ppl... good for guard act like a male dog..she will sleept in mattres or cradle..whn she eat u can even touch her...we let her because no time to care she... so anyybody intrested to addopt plss call to.. im Mr.Tom..thx petfinder... PhotoAmt: 2.0."}
{"label": 2, "text": "Animal Type: Dog. Breed 1: Mixed Breed. Breed 2: Unknown Breed. Color 1: Black. Color 2: Unknown Color. Color 3: Unknown Color. State: Kuala Lumpur. Age: 2. Gender: 2. MaturitySize: 2. FurLength: 1. Vaccinated: 2. Dewormed: 1. Sterilized: 2. Health: 1. Quantity: 1. Fee: 0. VideoAmt: 0. Description: This cutie dumped by it's owner at the market and almost kill by the car, after kicking by the guy, trying to hide herself for safe under the car while the driver is ready to run, ran to her hit on the car to notice the driver stop before i pulled her out and safe her. Luckily the kindness factory guy is allowed me to keep her there, cause my shop is full with 19 dogs and cats, situation not allow me to take in more, due to my work i could only feed her once a day and clean her cage. She's a black beauty, about 2months +, if anyone able to give her a forever home, please do directly contact with me or sms me,thanks! And PLEASE the more i can rehome, the more i can rescue!. PhotoAmt: 8.0."}
{"label": 4, "text": "Animal Type: Cat. Breed 1: Domestic Short Hair. Breed 2: Unknown Breed. Color 1: Black. Color 2: Brown. Color 3: White. State: Selangor. Age: 1. Gender: 3. MaturitySize: 1. FurLength: 1. Vaccinated: 2. Dewormed: 2. Sterilized: 2. Health: 1. Quantity: 5. Fee: 0. VideoAmt: 0. Description: Birth Date: Oct 30th Kitty 1, Melly -Female Sangat comel and vokal. Kitty 2, Tootsie - Male Badan putih, tapi ekor hitam and telinga kekuning-kuningan, macam kucing 3 color. Kitty 3, Bo -Male Corak badan 3 tompok, he is one of the most quite and lightest kitty of the litter tapi jantan. Kitty 4, Michii - Female Macam abang kembar, she is very subtle and sweet, have 1 big spot behind her back and 1 super cute spot belakang telinga. Kitty 5, Missy - Female. She is very curious and adventurous. Very lovable, with sweet voice !. PhotoAmt: 1.0."}
